In [14]:
import numpy as np
import pandas as pd
from finta import TA
import matplotlib.pyplot as plt

In [4]:
apiKey='HO0PUVKW0S8C5V0D' # добавьте ключ API

interval_var = '5min'
symbol='ETH'

path='https://www.alphavantage.co/query?function=CRYPTO_INTRADAY&symbol='+symbol+'&market=USD&interval='+interval_var+'&apikey='+apiKey+'&datatype=csv&outputsize=full'
df = pd.read_csv(path)
df

               timestamp     open     high      low    close  volume
0    2022-07-10 16:20:00  1159.94  1160.71  1158.32  1160.36    2502
1    2022-07-10 16:15:00  1157.08  1160.69  1156.14  1159.94    4039
2    2022-07-10 16:10:00  1161.99  1162.00  1153.00  1157.08   13292
3    2022-07-10 16:05:00  1165.28  1165.68  1160.55  1162.00    5470
4    2022-07-10 16:00:00  1163.59  1166.51  1161.82  1165.28    8293
..                   ...      ...      ...      ...      ...     ...
995  2022-07-07 05:25:00  1171.96  1173.12  1169.08  1169.92    2632
996  2022-07-07 05:20:00  1173.38  1173.72  1171.00  1171.96    2241
997  2022-07-07 05:15:00  1174.98  1175.05  1173.11  1173.37    1362
998  2022-07-07 05:10:00  1172.58  1175.10  1172.08  1174.99    2135
999  2022-07-07 05:05:00  1172.39  1172.70  1171.41  1172.64    1430

[1000 rows x 6 columns]

In [7]:
TA.TR(df)

0      2.39
1      4.55
2      9.00
3      8.60
4      4.69
       ...
995    4.04
996    3.80
997    3.09
998    3.02
999    3.58
Name: TR, Length: 1000, dtype: float64

In [9]:
TA.ATR(df, 20)

0         NaN
1         NaN
2         NaN
3         NaN
4         NaN
        ...
995    3.4145
996    3.4225
997    3.4550
998    3.4270
999    3.4250
Name: 20 period ATR, Length: 1000, dtype: float64

In [10]:
TA.VPT(df)

0        879.364017
1       5956.964017
2      -8546.084872
3     -15540.860701
4      -9564.242364
           ...
995    41789.459476
996    39449.591829
997    37188.952654
998    40596.469210
999    41150.732776
Name: VPT, Length: 1000, dtype: float64

In [11]:
TA.BBANDS(df)

        BB_UPPER  BB_MIDDLE     BB_LOWER
0            NaN        NaN          NaN
1            NaN        NaN          NaN
2            NaN        NaN          NaN
3            NaN        NaN          NaN
4            NaN        NaN          NaN
..           ...        ...          ...
995  1172.263785  1168.2165  1164.169215
996  1172.652619  1168.3235  1163.994381
997  1173.433515  1168.5515  1163.669485
998  1174.532991  1168.8635  1163.194009
999  1174.896528  1169.2210  1163.545472

[1000 rows x 3 columns]

In [12]:
TA.BBWIDTH(df)

0           NaN
1           NaN
2           NaN
3           NaN
4           NaN
         ...
995    0.006929
996    0.007411
997    0.008356
998    0.009701
999    0.009708
Name: 20 period BBWITH, Length: 1000, dtype: float64